<?php

return [
    'plugin' => [
        'name' => 'Документація',
        'desc' => 'Проста документація для сайту',
    ],
    'component' => [
        'item' => [
            'name' => 'Сторінки документації',
            'desc' => 'Виводить окремі сторінки документації',
            'prop' => [
                'slug_title' => 'Параметр URL',
                'slug_desc' => 'Параметр маршруту, який використовується для визначення запису (документу) по його URL.',
                'stek_title' => 'Підсвітка',
                'stek_desc' => 'Стек мов програмування та технологій для яких буде виконуватись підсвічування коду.',
                'stek_all' => 'Всі мови',
                'stek_wn' => 'Стек Winter CMS',
                'theme_title' => 'Тема підсвічування коду',
            ],
        ],
        'menu' => [
            'name' => 'Меню документації',
            'desc' => 'Виводить посилання на сторінки документації',
            'prop' => [
                'doc_page_title' => 'Сторінка запису',
                'doc_page_desc' => 'Обреріть сторінку CMS що виводить окремий запис документа. Це необхідно для формування url-адрес пунктів меню.',
            ],
        ],
    ],
    'fields' => [
        'published' => 'Опубліковано',
        'created' => 'Створено',
        'updated' => 'Змінено',
        'title' => 'Назва',
        'meta_img' => 'Meta-зображення',
        'tab_content' => 'Зміст',
        'repiter_prompt_css_files' => 'Додати файл CSS',
        'label_add_url_css_files' => 'Вкажіть Url-адресу CSS-файлу',
        'repiter_prompt_js_files' => 'Додати файл JS',
        'label_add_url_js_files' => 'Вкажіть Url-адресу JS-файлу',
        'title_placeholder' => 'Назва запису',
        'slug_placeholder' => 'item-slug',
    ],
    'config' => [
        'name' => 'Документ',
        'create_title' => 'Створення запису',
        'edit_title' => 'Редагування запису',
        'preview_title' => 'Перегляд запису',
        'list_title' => 'Список документації',
        'reorder_title' => 'Сортування документів',
    ],
    'controller' => [
        'items' => 'Записи',
        'new' => 'Новий запис',
        'creating' => 'Створення запису...',
        'saving' => 'Збереження запису...',
        'deleting' => 'Видалення запису...',
        'confirm_delete' => 'Видалити цей запис?',
        'reorder' => 'Сортувати записи',
        'data_window_close_confirm' => 'Запис не було збережено після змін. Бажаєте продовжити?',
    ],
];
